; domain
(define (domain logistics-strips)
  (:requirements :strips) 
  (:predicates 	(OBJ ?obj)
	       	(TRUCK ?truck)
               	(LOCATION ?loc)
		(AIRPLANE ?airplane)
                (CITY ?city)
                (AIRPORT ?airport)
		(at ?obj ?loc)
		(in ?obj1 ?obj2)
		(in-city ?obj ?city))
 
  ; (:types )		; default object

(:action LOAD-TRUCK
  :parameters
   (?obj
    ?truck
    ?loc)
  :precondition
   (and (OBJ ?obj) (TRUCK ?truck) (LOCATION ?loc)
   (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck)))

(:action LOAD-AIRPLANE
  :parameters
   (?obj
    ?airplane
    ?loc)
  :precondition
   (and (OBJ ?obj) (AIRPLANE ?airplane) (LOCATION ?loc)
   (at ?obj ?loc) (at ?airplane ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?airplane)))

(:action UNLOAD-TRUCK
  :parameters
   (?obj
    ?truck
    ?loc)
  :precondition
   (and (OBJ ?obj) (TRUCK ?truck) (LOCATION ?loc)
        (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc)))

(:action UNLOAD-AIRPLANE
  :parameters
   (?obj
    ?airplane
    ?loc)
  :precondition
   (and (OBJ ?obj) (AIRPLANE ?airplane) (LOCATION ?loc)
        (in ?obj ?airplane) (at ?airplane ?loc))
  :effect
   (and (not (in ?obj ?airplane)) (at ?obj ?loc)))

(:action DRIVE-TRUCK
  :parameters
   (?truck
    ?loc-from
    ?loc-to
    ?city)
  :precondition
   (and (TRUCK ?truck) (LOCATION ?loc-from) (LOCATION ?loc-to) (CITY ?city)
   (at ?truck ?loc-from)
   (in-city ?loc-from ?city)
   (in-city ?loc-to ?city))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)))

(:action FLY-AIRPLANE
  :parameters
   (?airplane
    ?loc-from
    ?loc-to)
  :precondition
   (and (AIRPLANE ?airplane) (AIRPORT ?loc-from) (AIRPORT ?loc-to)
	(at ?airplane ?loc-from))
  :effect
   (and (not (at ?airplane ?loc-from)) (at ?airplane ?loc-to)))
)

; problem
(define (problem logistics-c3-s1-p19-a2)
(:domain logistics-strips)
(:objects a0 a1 
          c0 c1 c2 
          t0 t1 t2 
          l0-0 l1-0 l2-0 
          p0 p1 p2 p3 p4 p5 p6 p7 p8 p9 p10 p11 p12 p13 p14 p15 p16 p17 p18 
)
(:init
    (AIRPLANE a0)
    (AIRPLANE a1)
    (CITY c0)
    (CITY c1)
    (CITY c2)
    (TRUCK t0)
    (TRUCK t1)
    (TRUCK t2)
    (LOCATION l0-0)
    (in-city  l0-0 c0)
    (LOCATION l1-0)
    (in-city  l1-0 c1)
    (LOCATION l2-0)
    (in-city  l2-0 c2)
    (AIRPORT l0-0)
    (AIRPORT l1-0)
    (AIRPORT l2-0)
    (OBJ p0)
    (OBJ p1)
    (OBJ p2)
    (OBJ p3)
    (OBJ p4)
    (OBJ p5)
    (OBJ p6)
    (OBJ p7)
    (OBJ p8)
    (OBJ p9)
    (OBJ p10)
    (OBJ p11)
    (OBJ p12)
    (OBJ p13)
    (OBJ p14)
    (OBJ p15)
    (OBJ p16)
    (OBJ p17)
    (OBJ p18)
    (at t0 l0-0)
    (at t1 l1-0)
    (at t2 l2-0)
    (at p0 l2-0)
    (at p1 l1-0)
    (at p2 l2-0)
    (at p3 l2-0)
    (at p4 l0-0)
    (at p5 l1-0)
    (at p6 l2-0)
    (at p7 l1-0)
    (at p8 l1-0)
    (at p9 l2-0)
    (at p10 l2-0)
    (at p11 l1-0)
    (at p12 l1-0)
    (at p13 l0-0)
    (at p14 l1-0)
    (at p15 l2-0)
    (at p16 l2-0)
    (at p17 l1-0)
    (at p18 l1-0)
    (at a0 l0-0)
    (at a1 l0-0)
)
(:goal
    (and
        (at p0 l0-0)
        (at p1 l0-0)
        (at p2 l0-0)
        (at p3 l0-0)
        (at p4 l0-0)
        (at p5 l0-0)
        (at p6 l2-0)
        (at p7 l1-0)
        (at p8 l0-0)
        (at p9 l0-0)
        (at p10 l0-0)
        (at p11 l2-0)
        (at p12 l1-0)
        (at p13 l0-0)
        (at p14 l1-0)
        (at p15 l1-0)
        (at p16 l2-0)
        (at p17 l1-0)
        (at p18 l0-0)
    )
)
)

; plan
1. (fly-airplane a1 l0-0 l2-0)
   deleted: (at a1 l0-0)
   added: (at a1 l2-0)
   goals met: 8 of 19
2. (load-airplane p9 a1 l2-0)
   deleted: (at p9 l2-0)
   added: (in p9 a1)
   goals met: 8 of 19
3. (load-airplane p3 a1 l2-0)
   deleted: (at p3 l2-0)
   added: (in p3 a1)
   goals met: 8 of 19
4. (load-airplane p2 a1 l2-0)
   deleted: (at p2 l2-0)
   added: (in p2 a1)
   goals met: 8 of 19
5. (load-airplane p15 a1 l2-0)
   deleted: (at p15 l2-0)
   added: (in p15 a1)
   goals met: 8 of 19
6. (load-airplane p10 a1 l2-0)
   deleted: (at p10 l2-0)
   added: (in p10 a1)
   goals met: 8 of 19
7. (load-airplane p0 a1 l2-0)
   deleted: (at p0 l2-0)
   added: (in p0 a1)
   goals met: 8 of 19
8. (fly-airplane a1 l2-0 l1-0)
   deleted: (at a1 l2-0)
   added: (at a1 l1-0)
   goals met: 8 of 19
9. (load-airplane p8 a1 l1-0)
   deleted: (at p8 l1-0)
   added: (in p8 a1)
   goals met: 8 of 19
10. (load-airplane p5 a1 l1-0)
   deleted: (at p5 l1-0)
   added: (in p5 a1)
   goals met: 8 of 19
11. (load-airplane p18 a1 l1-0)
   deleted: (at p18 l1-0)
   added: (in p18 a1)
   goals met: 8 of 19
12. (unload-airplane p15 a1 l1-0)
   deleted: (in p15 a1)
   added: (at p15 l1-0)
   goals met: 9 of 19
13. (load-airplane p11 a1 l1-0)
   deleted: (at p11 l1-0)
   added: (in p11 a1)
   goals met: 9 of 19
14. (load-airplane p1 a1 l1-0)
   deleted: (at p1 l1-0)
   added: (in p1 a1)
   goals met: 9 of 19
15. (fly-airplane a1 l1-0 l0-0)
   deleted: (at a1 l1-0)
   added: (at a1 l0-0)
   goals met: 9 of 19
16. (unload-airplane p9 a1 l0-0)
   deleted: (in p9 a1)
   added: (at p9 l0-0)
   goals met: 10 of 19
17. (unload-airplane p8 a1 l0-0)
   deleted: (in p8 a1)
   added: (at p8 l0-0)
   goals met: 11 of 19
18. (unload-airplane p5 a1 l0-0)
   deleted: (in p5 a1)
   added: (at p5 l0-0)
   goals met: 12 of 19
19. (unload-airplane p3 a1 l0-0)
   deleted: (in p3 a1)
   added: (at p3 l0-0)
   goals met: 13 of 19
20. (unload-airplane p2 a1 l0-0)
   deleted: (in p2 a1)
   added: (at p2 l0-0)
   goals met: 14 of 19
21. (unload-airplane p18 a1 l0-0)
   deleted: (in p18 a1)
   added: (at p18 l0-0)
   goals met: 15 of 19
22. (unload-airplane p10 a1 l0-0)
   deleted: (in p10 a1)
   added: (at p10 l0-0)
   goals met: 16 of 19
23. (unload-airplane p1 a1 l0-0)
   deleted: (in p1 a1)
   added: (at p1 l0-0)
   goals met: 17 of 19
24. (unload-airplane p0 a1 l0-0)
   deleted: (in p0 a1)
   added: (at p0 l0-0)
   goals met: 18 of 19
25. (fly-airplane a1 l0-0 l2-0)
   deleted: (at a1 l0-0)
   added: (at a1 l2-0)
   goals met: 18 of 19
26. (unload-airplane p11 a1 l2-0)
   deleted: (in p11 a1)
   added: (at p11 l2-0)
   goals met: 19 of 19
